# libraries

In [14]:
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
pd.set_option('display.float_format', '{:.2f}'.format)

# reading csv

In [15]:
customers = pd.read_csv('C:\\Users\\axelm\\OneDrive\\Documentos\\python\\Datos necesarios\\customers.csv')
customers.head(10)

   customer_id                                       type
0       383249                            Hogar con Venta
1       249859                     Estanquillos / kioscos
2       106498                     Estanquillos / kioscos
3       385264  Abarrotes / Almacenes / Bodegas / Víveres
4       165442                     Estanquillos / kioscos
5       275395                     Estanquillos / kioscos
6       147449                            Hogar con Venta
7       382939                     Estanquillos / kioscos
8       345755                            Hogar con Venta
9       175659                     Farmacia Independiente

In [16]:
diccionario = pd.read_excel("C:\\Users\\axelm\\OneDrive\\Documentos\\python\\Datos necesarios\\Diccionario de datos.xlsx")
diccionario.head(10)

,Módulo,Variable,Descripción,Unidad,Agregación
0,Variables Demográficas,NaN,NaN,NaN,NaN
1,Ingreso,ingreso_promedio_300m,Promedio del Ingreso mensual per cápita,Pesos,300m
2,Distribución del gasto,gasto_promedio_300m,Estimación del gasto mensual promedio per cápita,Pesos,300m
3,Población flotante,flo_sem_0a14_300m,Población flotante 0 a 14 años,Personas,300m
4,Población flotante,flo_sem_15a29_300m,Población flotante 15 a 29 años,Personas,300m
5,Población flotante,flo_sem_30a44_300m,Población flotante 30 a 44 años,Personas,300m
6,Población flotante,flo_sem_45a64_300m,Población flotante 45 a 64 años,Personas,300m
7,Población flotante,flo_sem_65amas_300m,Población flotante 65 años y más,Personas,300m
8,Población flotante,flo_finde_tot_300m,Población flotante fin de semana,Personas,300m
9,Variables de Entorno,NaN,NaN,NaN,NaN

In [17]:
sales = pd.read_csv('C:\\Users\\axelm\\OneDrive\\Documentos\\python\\Datos necesarios\\sales.csv')
sales.head(10)

   customer_id   month  amount  churn_next_month
0       100000  202102   48.07              0.00
1       100000  202306   40.30              0.00
2       100000  202308   32.90              0.00
3       100000  202207   50.72              0.00
4       100000  202212   47.87              0.00
5       100000  202010   84.43              0.00
6       100000  202107   75.96              0.00
7       100000  202110   92.41              0.00
8       100000  202008   37.66              0.00
9       100000  202009   50.07              0.00

In [18]:
sub = pd.read_csv('C:\\Users\\axelm\\OneDrive\\Documentos\\python\\Datos necesarios\\team_XX_submissions.csv')
sub.head(10)

   customer_id   month  churn_next_month
0          123  202311                 0
1          124  202311                 1

# checking sales

In [19]:
len(sales)

5386175

In [20]:
sales.isna().sum()

customer_id             0
month                   0
amount                  0
churn_next_month    94272
dtype: int64

In [21]:
len(set(sales['customer_id']))

170367

In [22]:
sales.describe()

       customer_id      month     amount  churn_next_month
count   5386175.00 5386175.00 5386175.00        5291903.00
mean     250112.72  202139.33     215.23              0.01
std       86654.30     116.40     299.69              0.12
min      100000.00  201911.00    -343.77              0.00
25%      174945.50  202011.00      54.31              0.00
50%      250360.00  202110.00     130.96              0.00
75%      325280.00  202210.00     275.67              0.00
max      399999.00  202311.00   24286.95              1.00

In [23]:
len(sales[sales.amount < 0])

107

In [24]:
sales[sales.amount < 0].head()

        customer_id   month  amount  churn_next_month
44694        102503  202205   -0.09              1.00
99026        105528  202302   -0.72              0.00
119379       106607  202207   -0.00              1.00
148344       108253  202210   -0.00              1.00
204773       111343  202203   -0.00              0.00

In [25]:
sales['month'] = sales['month'].astype(str)

sales['year'] = sales['month'].str[:4]
sales['month'] = sales['month'].str[4:]

sales['month'] = sales['month'].astype(int)
sales['year'] = sales['year'].astype(int)

sales.head()

   customer_id  month  amount  churn_next_month  year
0       100000      2   48.07              0.00  2021
1       100000      6   40.30              0.00  2023
2       100000      8   32.90              0.00  2023
3       100000      7   50.72              0.00  2022
4       100000     12   47.87              0.00  2022

# creating full db

In [26]:
full_db = pd.merge(sales, customers, on='customer_id', how='left')
full_db.head()

   customer_id  month  amount  churn_next_month  year                    type
0       100000      2   48.07              0.00  2021  Estanquillos / kioscos
1       100000      6   40.30              0.00  2023  Estanquillos / kioscos
2       100000      8   32.90              0.00  2023  Estanquillos / kioscos
3       100000      7   50.72              0.00  2022  Estanquillos / kioscos
4       100000     12   47.87              0.00  2022  Estanquillos / kioscos